artillery.yml
config:
  target: "https://app.proposify.net"
  engines:
    playwright:
      launchOptions: false
      headless: true
  processor: "./tests/artillery/login.js"  # Correct relative path to your script
  phases:
    - duration: 300 # Phase 1 duration
      rampTo: 2  # Gradually increase virtual users from 1 to 2 over 5 minutes
    - duration: 120  # Phase 2 duration
      arrivalRate: 6 # Maintain 6 users for 2 minutes
    - duration: 60
      rampTo: 0

scenarios:
  - engine: "playwright"
    testFunction: "artilleryScript"  # This is the function name being called from your script

after:
  flow:
    - function: "cleanup"