artillery.yml
config:
  target: "https://app.proposify.net"
  engines:
    playwright:
      launchOptions: false
      headless: true
  processor: "./tests/artillery/login.js"  # Correct relative path to your script
  phases:
    - duration: 120  # Phase 1 duration
      arrivalRate: 6 # Maintain 6 users for 2 minutes
    - duration: 300 # Phase 2 duration
      rampTo: 2  # Gradually increase virtual users from 1 to 2 over 5 minutes

scenarios:
  - engine: "playwright"
    flow:
      - function: "artilleryScript"  # This will execute the artilleryScript function, which in turn calls testLogin

after:
  function: "cleanup"  # This will run after the test is finished for any cleanup actions